### Plan for staging
🟡 Modify aws_dynamodb_table.ab_tests
🟡 Modify aws_iam_policy.ab_testing_task_role_policy
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**0 to add, 2 to modify, 3 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # data.aws_iam_policy_document.ab_testing_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ab_testing_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_test_participants",
              + "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_tests",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "vpc-03e5c953acbcda81b",
                ]
              + variable = "aws:sourceVpc"
            }
        }
    }

  # aws_dynamodb_table.ab_tests will be updated in-place
  ~ resource "aws_dynamodb_table" "ab_tests" {
      ~ billing_mode                = "PROVISIONED" -> "PAY_PER_REQUEST"
        id                          = "ab_tests"
        name                        = "ab_tests"
      ~ read_capacity               = 1 -> 0
      ~ tags                        = {
            "Terraform"  = "true"
          + "table_name" = "ab_tests"
            "team"       = "multi-product"
        }
      ~ tags_all                    = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "table_name"     = "ab_tests"
          + "team"           = "multi-product"
        }
      ~ write_capacity              = 1 -> 0
        # (6 unchanged attributes hidden)

      + attribute {
          + name = "version"
          + type = "N"
        }

      ~ point_in_time_recovery {
          ~ enabled = false -> true
        }

      + server_side_encryption {
          + enabled = true
        }

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.ab_testing_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "ab_testing_task_role_policy" {
        id          = "arn:aws:iam::545209064596:policy/ab-testing-task-role-policy"
        name        = "ab-testing-task-role-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "aws:sourceVpc" = "vpc-03e5c953acbcda81b"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_tests",
                          - "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_test_participants",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "996113177383539672" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T15:36:00Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "7698032455845634264" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T15:36:00Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.11-59" -> "0.0.12-62"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.11-59" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.12-62"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.11-59" -> "0.0.12-62"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.11-59" -> "0.0.12-62"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: staging.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "staging.plan"

```
</details>